file = open('points_ege.txt')
points = dict()
fam = ['Алиев', 'Меркулова', 'Минченко', 'Миронова', 'Мощик', 'Панфилова', 'Петров', 'Савельев', 'Хлоян', 'Хомрач', 'Шульгина', 'Сурин', 'Купреев', 'Кречетов', 'Буков', 'Васильева', 'Воеводин', 'Воронцов', 'Говричев', 'Голиков', 'Горбунов', 'Григорьев', 'Дивянин', 'Диденко', 'Ершов', 'Жилина', 'Завалишина', 'Загибалов', 'Заика', 'Здоровец', 'Исакин', 'Карпушин', 'Киреева', 'Кочеткова']


for i in file:
    s = i.split()
    points[s[0]] = s[-1]

for i in sorted(fam):
    if i in points:
        print(points[i])
    else:
        print('')